In [3]:
# Pandas merge connects columns or indexes in DataFrame based on one or more keys
import pandas as pd

In [8]:
df1 = pd.DataFrame({
    'ID': [1,2,3,4],
    'Class': [9,10,11,12],
})
df1

   ID  Class
0   1      9
1   2     10
2   3     11
3   4     12

In [9]:
df2 = pd.DataFrame({
    'ID': [1,2,3,5],
    'Name': ['A', 'B', 'C', 'D'],
})
df2

   ID Name
0   1    A
1   2    B
2   3    C
3   5    D

In [10]:
pd.merge(df1,df2, on = 'ID')

   ID  Class Name
0   1      9    A
1   2     10    B
2   3     11    C

In [11]:
pd.merge(df1,df2, on = 'ID', how = 'inner')

   ID  Class Name
0   1      9    A
1   2     10    B
2   3     11    C

In [12]:
pd.merge(df1,df2, on = 'ID', how = 'left')

   ID  Class Name
0   1      9    A
1   2     10    B
2   3     11    C
3   4     12  NaN

In [13]:
pd.merge(df1,df2, on = 'ID', how = 'right')

   ID  Class Name
0   1    9.0    A
1   2   10.0    B
2   3   11.0    C
3   5    NaN    D